In [2]:
import pandas as pd
from pathlib import Path

In [3]:
csv_path = Path("nasdaq_yahoo_finance.csv")

In [4]:
nasdaq_95 = pd.read_csv(csv_path, parse_dates=True, infer_datetime_format=True, index_col="Date")
nasdaq_95.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1995-01-03,751.309998,751.309998,743.530029,743.580017,743.580017,248750000
1995-01-04,744.770020,746.419983,740.469971,745.840027,745.840027,290350000
1995-01-05,746.869995,748.500000,745.130005,745.659973,745.659973,297510000
1995-01-06,746.270020,750.729980,745.760010,749.690002,749.690002,312920000
1995-01-09,750.190002,752.840027,750.099976,752.090027,752.090027,267090000

In [5]:
nasdaq_95.dtypes

Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [6]:
nasdaq_95.drop(columns=['Open', 'High', 'Low', 'Close', 'Volume'], inplace=True)
nasdaq_95.head()

             Adj Close
Date
1995-01-03  743.580017
1995-01-04  745.840027
1995-01-05  745.659973
1995-01-06  749.690002
1995-01-09  752.090027

In [7]:
nasdaq_95.isnull()

            Adj Close
Date
1995-01-03      False
1995-01-04      False
1995-01-05      False
1995-01-06      False
1995-01-09      False
...               ...
2005-12-23      False
2005-12-27      False
2005-12-28      False
2005-12-29      False
2005-12-30      False

[2771 rows x 1 columns]

In [8]:
nasdaq_95.isnull().sum()

Adj Close    0
dtype: int64

In [9]:
nasdaq_95.duplicated()

Date
1995-01-03    False
1995-01-04    False
1995-01-05    False
1995-01-06    False
1995-01-09    False
              ...
2005-12-23    False
2005-12-27    False
2005-12-28    False
2005-12-29    False
2005-12-30    False
Length: 2771, dtype: bool

In [10]:
nasdaq_95.head()

             Adj Close
Date
1995-01-03  743.580017
1995-01-04  745.840027
1995-01-05  745.659973
1995-01-06  749.690002
1995-01-09  752.090027

In [11]:
nasdaq_95.reset_index(inplace=True)
nasdaq_95_2=nasdaq_95.loc[nasdaq_95['Date'].isin(['1995-01-05'])]
nasdaq_95_2

        Date   Adj Close
2 1995-01-05  745.659973

In [12]:
nasdaq_95_2.reset_index(inplace=True)

In [13]:
nasdaq_95_2

   index       Date   Adj Close
0      2 1995-01-05  745.659973